{
  "id": "oblique-strategies",
  "name": "Oblique Strategies",
  "emoji": "📋",
  "description": "Random creative prompts to break mental blocks and spark breakthrough thinking",
  "triggers": [
    "oblique strategies",
    "creative block",
    "breakthrough thinking",
    "stuck",
    "mental block",
    "deadlock",
    "unconventional approach",
    "shift perspective"
  ],
  "enhancedThinkingEnabled": true,
  "steps": [
    {
      "id": "prompt",
      "name": "Draw Random Prompt - Generate unexpected creative stimulus",
      "description": "Select a random, unrelated prompt to shift perspective and break conventional thinking patterns\n\n🧠 ENHANCED THINKING REQUIRED: Use the SequentialThinking tool to work through this systematically.\n\nGenerate a completely random word, phrase, or concept unrelated to this problem. Examples: 'Use an old idea', 'What would your enemy do?', 'Honor thy error as a hidden intention', 'Look closely at the most embarrassing details and amplify them'. Apply this oblique stimulus to your challenge.",
      "requiresEnhancedThinking": true
    },
    {
      "id": "connect",
      "name": "Apply Obliquely - Connect random prompt to your challenge",
      "description": "Force unexpected connections between the random prompt and your specific problem\n\n🧠 ENHANCED THINKING REQUIRED: Use the SequentialThinking tool to work through this systematically.\n\nTake the random prompt and force connections to your challenge. How could this seemingly unrelated concept apply? What properties, functions, or characteristics could transfer? What if you took this prompt literally? What if you applied it metaphorically?",
      "requiresEnhancedThinking": true
    },
    {
      "id": "explore",
      "name": "Explore Tangents - Follow unexpected connections",
      "description": "Pursue the tangential thinking paths opened by the oblique prompt",
      "requiresEnhancedThinking": false
    },
    {
      "id": "synthesize",
      "name": "Synthesize Insights - Integrate breakthrough perspectives",
      "description": "Combine oblique insights with practical implementation approaches",
      "requiresEnhancedThinking": false
    }
  ]
}
